ans 1->

In [1]:
import pandas as pd

In [2]:
s=[4,8,15,16,23,42]

In [3]:
series=pd.Series(s)

In [4]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

ans 2-> list of 10 variables={1,2,3,4,5,6,7,8,9,10}

In [7]:
variables=[1,2,3,4,5,6,7,8,9,10]

In [8]:
var=pd.Series(variables)

In [9]:
print(var)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

SyntaxError: invalid syntax (3996045401.py, line 1)

In [2]:
# ans 3->
data={'Name': ['Alice', 'Bob', 'Charlie'],
      'Age':[25, 30, 35],
     'city':['Female','Male','Female']}
df=pd.DataFrame(data)
print(df)

NameError: name 'pd' is not defined

ans 4->
DataFrame  - a data frame in pandas is a 2 dimensional labeled data structure with colums of different data types.
data frames provide a powerful way to analyze data,and commonly used in pandas.

example of dataframe as follow

In [3]:

data ={'roll.no':[1,2,3,4,5],
      'name':['deepti','tusar','ansh','archana','arun'],
       'marks':[99,99,90,89,78]}
df=pd.DataFrame(data)
print(df)

NameError: name 'pd' is not defined

Series - a series is a one-dimensional labeled array that can hold data.
seriesis used to represnt a single column of data in a data frames.

example of series - ans 1 is an example of series

ans 5->
some common functions used to manipulate data in DataFrames.
1.head() and tail() - these function used to view some rows of top and bottom of dataframes.
2.sort() - it used to arrange the data in sorted way i.e.according to numbers and letter
3.drop() - it is used to delete the particular row or colum which is assign
4.columns - it is used to present header of columns

In [29]:
df.head(3)

   roll.no    name  marks
0        1  deepti     99
1        2   tusar     99
2        3    ansh     90

In [30]:
df.tail(2)

   roll.no     name  marks
3        4  archana     89
4        5     arun     78

In [32]:
df.sort_values('marks')

   roll.no     name  marks
4        5     arun     78
3        4  archana     89
2        3     ansh     90
0        1   deepti     99
1        2    tusar     99

In [36]:
df['marks'].dropna()

0    99
1    99
2    90
3    89
4    78
Name: marks, dtype: int64

ans 6->In Pandas, both Series and DataFrames are mutable in nature, while Panels are considered as immutable
Mutable means that the objects can be changed or modified after they have been created. In the case of
Series and DataFrames, you can modify their values, add or remove rows or columns, and perform various 
operations that change their structure or content.
Immutable are those which are not modify and changed.

ans 7-> we create a dataframe using multiple series

In [41]:
s1=pd.Series([1,2,3,4,5,6,7])
s2=pd.Series(['depu','muskan','priyanshi','chetan','priya','arun'])
s3=pd.Series(['B','A','C','B','D','A'])
df = pd.DataFrame({'series':s1,"name":s2,"grade":s3})
df

   series       name grade
0       1       depu     B
1       2     muskan     A
2       3  priyanshi     C
3       4     chetan     B
4       5      priya     D
5       6       arun     A
6       7        NaN   NaN